node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 7720013
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "y\230\257>\016\362\373\275\364=\224=\230X#<\331\007\364\275\032a\211\275a\260\357=\262*\204\276f\345\273\275\010\343\233\276\356\314\201=\330\2325>)4\363=\315\221\236=\007\310\020\2765\360\245\274\r\024$=B\247]\275\364=\223\275\273\263\314\275\271\002->1\374\300=\255\326\"\273?\225a>.\020\236\273Orb\275*\037\270=\261\311E=\247>\333=\260\357$>\253i\022\276\276\203\323=\201\034\221\275\252\266F>Z\316\326\274=\345\205=\233\376\242\274c<\276=\030\364F=p\n\277\275\014k\325:\253\310*\275\314\304\341=\207\037\223=h\321\262=\351\207(>QQO\276\303^|>h\234H\275\235\r\323\275q.\337=\200m\344\275\365\3154\276\356LX<;\037\357\275\372\353\323\274L\345\037\276\207\026\300<9<S\274bZ\204>\237O\021>T\231:>\213rv\276i\n\360\275\273\355\326\274\235\3145=\243*y\276.\353\233;\014\215\026\276\201N\333=/i\371<2\216\223=,\244O>f~\325\275\211\246I=b\037\376<\271@\256=\264\234\260<\013\330\t>X\024\252\275\253\370\321\275\212\003G=\3246\221\276\241\230\037\274\320\260\266\275\326\361\'\276\222\372\331\275+B\310=i\277X>\317\362\004>\322:\001=\254!.=gs\200=7\315\'\276\314\236Z>\377\354\257\274\243\'E>\203D\357<\202\200\013\276\300\037\225:\306\205\">|\202\261\274\t\364\217\276\325\267y\275h1\217=\220y\232\274\336\310\334\275`0\351=5\017r>\305@\363\275-\305\256\2751\266\242=\223\373\237\275yM\327\275\003|\"==F\005>#\016\234=\353\261s>kS\n\275\203\235\010>\377\032\177>4\355\232\276*\023-\274\317)\016\275\377\2150>\371u\206>\275jA\276\326\016v\275\367(U\275Qr8\275w\366\332\275]\234\337<+\327*\276,D%=\335\211\203\276t=\222=\t\035\211= \254\243=\354EC=b\013\211>\320a\301\275$\277\276<x5\313=\236\"_\276\315\343 \276\036c\364\275;V\003<\225\022i=2\225a\274\335\2660\275Aj@\275+\206\241\274\315\265N\275\016r\316=K@\'\276c\256\202>\\\027\315=(\242\n>\274\350V>X\001e\275\021\236\210=\n\213\232;\324[\275\272@\375\376\273\250r\214=B\245\277<kN\271\275F\006c\276\014\301w=\371\312\t\275\177\304N\274\301\374\027>3\324\247;\014\275\327\275Gw\177>2\037\r>\347\373n=bb\336\274s\300\017\276\213h\345\274\230\237\363<\016~5\275\261\332\306\275Kjl\275\346\332\371\275~\340c\275\364\320&=\3702\201\275\216j\207=\307x\017<\001!\032\275_\031O\276\210\267C\275\243\365\262>\200\364$\276F\203@\276\304\223\333\275O\372B>}\237\344=\030\343\035\276\252\362j=\315?E>Obt>\301\213\\=\314m\235<\035\247\366=p\276\261\2752\315\371\275d:m>\023=l\274z4\n>k\336\005\275LSm\275,\333\032\272\272\3220\275\013\305\035>\207\267\n>\323\260o=$\246\032<\354\204\226=\255\205(\275\325w\222=\220\022\177\276\276\236[\276Q\030<\276\227\214\377\275\02238>\035\306\201>uIv\275\232\214~=\030\202\265=\203h%>r)v\275\0319\326\275\254\220\030>?P<\276\237\335,=\r\203B=\246\r\257\273O\255\273<HJ\340\275\267hX\276\321\211\223\276\234b\014>\345[\037=\031\272\253\274\341>\366\275G\213\225\274\242;\276;e\033D<\036\252F\275\021\224\356\275\003W\327=\354\223\250\274.Q\343\274\321\302\036>C\017?\273=\354\006>\241s\026\276B\367\357\275]\203\007>\353c\224\2762E\023>\t\010+\276P\234\005\275\270\354\213=2~\202;\032\266\177=Ngv;\345mB=\371\203\203\276\316\232\275;\356\376X\276J\177N=r\326\260\275\351.]=I~E\275_\275\225<b\031\230\276\255\002\367;\004\032\363\275\247m\262\275\2272\352\275\035\245-=1?\200\276\224c3>(\327\370\275$\323\225\275%\320/>CT>>\005G\316=\027\243\214\275\310@\207\275\033%\243=\n\316\342\275z4\245\275\266T\253\274\204\255\221>\352\223\310\274\363\033J\275`\356\306\275\331^\024>\\\036X=j)\002>\331PS\276:\025)=\304\222\250\275\210h\276<\275\010\312\275\237\355w\275\t\2101\275N(\005=\333\316\357\275\320\211\260>\331q\\=\267\205\317=w\321\314\274k\030\322\275(\234\201=q\376\006>\376\257\246\275m\"\303\275!\020s<\010\036Q\275}c\222\275\036\372\374<\032\031e>\346\'\255<\314?>\276\247\252\033\276W\373O\275\231\372A\276\375&\351\275S&\023>\203#\333=\270c\274\275\177\201\240>\013c\200\276\233%l;\034M\r\276XvJ\276\030\312\361\274R=\211\274\346\303\224\274\235;\270;\224\205>>c\2269\274\031N1>\016\350\217>\022\217\202\276\260YT<\007J\236=\211c\226=\242\371\037\276\322\236\340\274\323\242i\275\221\314\303\275%\020\271\274\375\324\236<\256AN\274M\277\204\275!\004\214<mW\374\275\244\375`>QF\233;;\323\005\275y\030\213>\245c\266<\032\010\355=\357\373O>\313\334\004>\212k\270<\334\3421>\333\022\010=\230Q\276\273\315h\013\276Q\321%>.\030N\273\335\245\034\276\276\026\001>O\346\304\275\2429\203\274(o\267=f?b>\224(u\276\365\003Z\276\334\340\227=L\023\032>i\002\"\276}Db>\363\237D\275\305.\233\274.G\313\267a\374?=\351[\326\274\2322(\276\346v\351=!\365\370=\317\243\366=*\370\246\275\033\332o\275\3362\205>\367\354\364=\223Y\212\276/\352\024=~\024\254\274\271\037\213\275\0076\365<\236\307\214=\006\370\037>\013\177\334\273G\370\215\275\273\244I=\230=\342\274>A\203>\250\236\263\275\201\222\337=\270\346 >\221\355%\275\214\004F\275\310\177\253=\241\256\224\2751\307.=\013!\352=|!\'>\333\357N\276\300B\361=\213\006\207\275\n\217\354<\203\2452>[m5\275\324\314\215=\3738\032=C\025\226\274\035\244\220>\346\311\265=\337[\317=\217\236\246\275\343=\315=\325\364\211=\025w\244=\022G\001>\351\r\303=iXw;\"p?\276\200.\004\275)\356\022\272\001\201\235\275\003\337\025\274\227\3246=;\362\276\275\220\334\244\276\2370\t>\243\332j\275\374\202\236\276?\266]\274KI\226=\2762\357\274\017\021\256\275\326_\346\275\334CC=\022\204\316\276/\211\326\275\372\303\245\274\276\217\021\276T0*\276@\321\276\275\217\215\241=\\\0308\275\207(\007\276eL\017=\3232\311=\006\373l\276<a\241=sm\220=\377\343\255=f\244\206<\033D\275\275\300\340X>\352L6\275\022$f<\036\036G\275p\306\013\275D\023\236>\031\3522\275\214g\266\274\023Z\234\275\036\350@=\022o\262\274\334Y\310\275\225\275\222\275I.3=@\235l\276\016\227C\274\275 |=%\214R=\274\r\331\275?\'\222;\245dN>#F8\276\'[\347=\317W\221\275\037;\206=\265,\250\273h\217\034\276\241\'\026\275+\274$\276a\016\362\275E\226\260\275!\361\274=wo\007>\234\251r>%\205\237=7\257\n\276\023R\036\276\355\265U\276)\231-\276PbS\276R\325\332=r\3349=\202:\007\276\025\210\377=\225\317\367=\324ta\274\227\2435\275T\263\311<\261\210X\275\211\317$\275{\374\201\274\257\225`\276\342>\251\274\031l\261<\222\360\204\276r\356\021\276 \305\005;u\020\265<8C\257>M\010\373=Y\0145\276dk\022>\331\317\273\275\230]?\276\350;\006\275y\373\335\2757\375E\276\264\211\317\275E\305)>4\265>>w;/=\034\030\225\272l\250*>\244\360\r>Q\035[\275\210:\310\274\311\277\r\276\244d\324\274\241\376)=\024P\273\275^P\201=p`*\275\301uL>hQ\342; \366*\276\203\2635\275\264\316\320<\330M\202>\254R\270=\215\004\013\275/\233*\276\002\314\346\275\305\327\010\276T\206\035\275]W\247>\n\332\020\274\300\341\004>7\302\001>\272\316\216\275\353\307\014=\200\026:>\346\002!=\'\"\263\273IR\206\272\310\273\371\274cH`>~\264\274\275,\305P\276\007\215W\276\037\331\234\274\357\364\'>\300\223\225\274\373`}\275\253vB>\320\233\302;O\270\006<\347\203V>`\305\014\276M\370\025\275,W\225>;\3708\273\002\024\027=\347y(<\341[\306\275\177x\226>\344\234\255\275\230\274;\275\034\201\010\276%\r\251=\376lo=\327\236\343\275-\031|>\276q\010\276\306\214r\276\306\032V>\365\3421\276\245\337\365\273\013I\340;n\027\307\275\000\363\231=\272\317\232=2\006\216=\274Z\316\275A\202\324\275\326\310\034>DMI\276\311\232\234<\220\243k\276\232\210`\275H\362.\276\016\200\034\275t>\232\275K\236\232=\322\374\370=i\232G=\325g<=\217E\t>\325{\355\274\246.\024>@[\277\275\247\271,>,5\003\275^L\\=\270=k\275\326\321a=xZ\025\275\275\2265>\353\300p\274\177\357\021\276B\331x;\235\361\214\274[\000\032=1\251|>)\200\254=\263\211c\276\300\251\263\274\264\321)\276\016]\177\276n\0134\276\354\0236>\325o\257\275\271h[<\351m\246=\243W\207\275\220\036\314\275g\022\\>\204\031?\276k\261\026\276\031\306\022\276\354\356\024>t\001\207\275\253\013\336\275\354L0>\230\021{\276\351\2451>\223\024q=E\200k\273\001\251\305=\204B\306\275\256\350$>\326\326\221\275\311\343)=\231\255\343:$\036 ><\306\260\2752\270\227\274\030\357\'>\362|\306\275\206\375\350=;\220`>\260\243\271\275\n\303\225=F \003>\246\2167\275pB\231>\356\316\365\275\023E\231\276\244(T>%\342h\274\016\'\212\275\212nG\275S\356\002>\0014\035\276\320\333\001\276aX\362=\304\263\230\275=6\223>\007\303\233=E\2519=\'E\214<A\244R\275\032\001\017=e\365\206<\r\231\022>\327\372%>N5\247\274A\344\277\275\371\253\211=\262\013\221\273/\275\200=T\235\'=\20099\275\236\031\302=\t\362\224<~\267\344\275\276p\211\275\331a\205\275\360\261\t\276\301\035*=\'\251\212\275f/\364=\016\316\201\274\177\355->\301\3724\276\274\351\227=\344\367\227\275\263\274\365=b\306\337\275[l\032\276LT\003>\243V->\357\221\270\275\007\275K\276>\000H>\342T!\274\341]%\276L\030\203\276\353\r\342\275?\177\304\274%\014\302\275\364\351\246\275\251KC\2752W\206\274\300\246\030\276\303X\240<\217{\235>u3\363=F\350\260=\002\036\203\276\357?\307<6\322Z\276u:\303\275tQ\267\275KI+>\202\302\024=f\007\262>\303s\307=[\010\033>.Z\340=)\237\002\275\002\304\216=3[\224\275\220H\207\273\301/\341\275e5\364\2755\340\204\275\372\021D>\275-\014\274\017T\014=\216s\205\275\374\237\024=\010A\306\275v\277\010=cI\225=\322\234\335<\213\343\201=\231Z\025=\337\233\017=IY\214=\034S\354=\016 \005\274\\\321;\276\304_\276=H\327\304\275(\346\214=\t\034i\276\211\010B=\233\'\036\276\036\331\206=\357`\026\2751\235\212\274\243\251\220\275\276\255\203=\274\362\254=\010\307\302=\227q\227\275\354\375\024\275\210}\303\274\235\'\203=\245\320:<!\340\"\276\335\263?<5/\'<\027!\201\275\033\260\366\276\026\223\344\275N\327\312=W\274\363\275\256\206\013\275\r\2456>\344\314j<0K4<\010\207@\275\335\355$\276\232\326\007=\315xB=\226\360\237\274\300\246&=w\201\302=m\327H\275?\227x\276\253v\016\276\353\303\343\275\016\211\354>UG\311=\236\267\"\276YC\032=+\254\000=\352A\251\275q\213]>\304@\244=OW\354=j\003\336=\021\037+\276~\001#=\223\207S=\271-\207=\030\2358\2757)\023=7\'\330=\276\006\006=\204\376<=:\274H\276\250n\355=?E\235\275C\271\356\275/\252Q>6\255\217<\010C\222\276F\315\004\276\372\304\'\276>m\305\275\332|d=Jsh>\331 S>\221\213~\275m\007\211=N/J<\254\032\027\274\026k\363=\234\023v=;fb>\265\204\001\276m\023\027\274/b\336=\251\262\330=\300\241\214>w\247b>\034\347\033>\215\247\031<\263\264\324\275\216j\377\274\325~\205<|8\034>\244c\275=\330\3360\276\0012\203\275<\351W\275\247\341\364=n\346\277\275\265M\316<{<\265\276T\034\250\275\245\351\360\273Z\2152>\r\203\333=\341Q\360\275\260\221\025\275(\233<=\024\266\001>L\271m\275\324O\337\275\236\331\360=ks\351\275\340\205\310\274\032\216\270\275U\257e=Q+\212=\177\362\254\275\340w`>z\211\002\276\246a\263<\265\010\267>\212\270\376;\003\237\214\273\243\227*\276,\217\034\275\024~\323=\250\215\227=\313\225\'\276R\215\307\275\332\250\017=\313\006\300\2740\272\333=C\024\336=\231\r\353<|\307J>6\267\326=\"k\210>\371U=\276\304\306;\276\000\264\236\273/\211T>\245\037\374\275\"\205\026\276s\263\367\274\344+\234\275\301\347\223=V\217\307=\032_1\276\257p2\276\246\007\037\276d\r@>\373\031\325=\256\226\205\275D\017{\275\300<\336\274\020\'P\2744\256\020>\235\251\251<\267-Y;\236\307\003=3\002\363=Q\006F\276XR3\2768g4=\365\036k=\'\266\331\275\356bY>\023\367\230<\355\251\376\275A\226I>O! \276\326\272k\276\274\336$=E\311\242\276i\037\252\275G\264\331;R\347\317=ku\017\276\307b\272;b\344O\2753\206\n\276S\034\310\275$\"\225=\373P\323\274\232\020\233\275\361\377\370=\217\352\344\273 \255->w\n\003\276\006\363\024>\304\200\304\275\334J\263\275\301\365\203=\314\177]>F\227\244=`\027-\275\327>L\273\000\257\346=\233\263\247<k\3159\272\346\006\013=\345\221?\276D\t\262<\236*\344<c\022\370=w%\001\276_\006[\276P2\210\274\224\005\365\275C\037\243=\305i\010\276%\030+\276\226\235\035=\025\n\001\276\337v1=Q\367\025\276\332\276\307<\213o \276\020r\377=\247tf\276\203\227N<\256\266B\275\036\333\227<\236Rk\276G\276\327<n\224\335\274\t)\216>\360\257\034\274\215\346 >!R\241>\r;<\276z\302\344=\034\315\246\274_\234\273=\331\030T>\3530T>\225\262F>\337\036\014\275\366\341\201\275\360v\276<-\307\004>\'\035|\276y\272\234\274\346\236L=7\303\035=fCH>\260j\004\276j\001\313\273J[H\275\357^B\273\022\214u\274}\265H\275\247\"\313\275|\246\224\274\351v\025\275\007\273b>\327\377=\276\226\357\323=Sf\320;\263\356)>\265\270\204>\001A>\276/G5=2D(>\306e[\275G\364\r=+\347(>\276r:>\204\373)\274{/Y>\271BD>\271\201\262=\023\203 >\311(9>\t\026\341\275\235b\t\274\312WH\276tQ\232=\244\336J\275\320\241:\276\346rn>\327\010\373\273\2208;<CG\257\275z\340\033\2746\307\265=`\243\304\275\243\322\016=-\202\320\275\177\324\003>I\335\342=\306\0054>\332\035f\276Mz\310=\377\212\315\275(]\357\275K\367\033=\'\363X\2748C\">\237\005?\275\024]\003\276hp\026\276\nkh\276\031\212\256=\247\203^\276z@\201=\337u\203\275\226F\341<\320\254\345\275ol\271=\355\262Y\275\006sB\275\347*\373\274E\032\037>I\206\221\275\216\342e=\263<\215>;\217[\276\262\326\026>\347\345#>\312\325\020=\2344\004\275\213Y\265=\324^@\276~B\257=\302!\"\276\014\224\225=Y\303\'>\340\260\264\275$\345{\276?\253\r>j\242\232\275i\031\371\274\334\3552>x\336\025>7\260\212\275\260\266\341\272\n\007\262\276Qa\235\275\241Y\326\275\322\312\035>\261\2566=\225\0011\275csH=\366\010\276\275 %\310\275\344\351\031\275\206\276U=\3549@\2759\013\313\275\350\237:\276\374(]\275T\371B\274\216n\311;\356\202O\276\177\211e\275#;h\275\027\316(\273\245-\035<\341m\335=W\217\373;\250\371\376\274\307\227\314\275\235}I>\317O\310=\325\024\001>Mt\327=_s\310\276\367W\214=\327\310Z>\010\202\247<}\324\227<\320O\364=D\352F\276\037\257!>\333\260w<\374\275\024=Ru,>jT\372=l\372\224=h\351\216<\\\nC\274\275u\262\275\332\337*<\025j\222=\267dg=\355\326\213\276\247\304\212>\312y\225\275F\037\017\275\245\231\242=\340\250:>O\357t\275\004ca\275\345\275N>\265\"\274\273E\251\002\276\273\036\333=N\241 \276\272ZR=\224\364\237\2750uI=\320L\224\276\"\223.\276^\301\366\275\231\333\204=\0201\261=\rTA=\262M\264=\365C\002\276"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value/Minimum"
  op: "Minimum"
  input: "net/add_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "Maximum"
  input: "net/clip_by_value/Minimum"
  input: "net/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1/Minimum"
  op: "Minimum"
  input: "net/add_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "Maximum"
  input: "net/clip_by_value_1/Minimum"
  input: "net/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
